# HotConductorNum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wire..::..HotConductorNum Property
Wire Class See Also
---
The hot conductor number. Its default value is zero after created.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int HotConductorNum { get; set; }
```

Visual Basic
---
```text
Public Property HotConductorNum As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int HotConductorNum {
	int get ();
	void set (int value);
}
```

# See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace